# Install with: brew bundle
# Check status with: brew bundle check

# ============================================================================
# TAPS (Third-party repositories)
# ============================================================================
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "tvanreenen/tap"

# ============================================================================
# FORMULAE (Command-line tools)
# ============================================================================

brew "azure-cli"
brew "felixkratz/formulae/sketchybar"
brew "fzf"
brew "gh"
brew "jq"
brew "just"
brew "llm"
brew "mac-cleanup-go"
brew "mkcert"
brew "neovim"
brew "node"
brew "starship"
brew "stow"
brew "terraform"
brew "uv"
brew "wget"
brew "worktrunk"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "zsh-vi-mode"

# ============================================================================
# CASKS (GUI Applications)
# ============================================================================

cask "appcleaner"
cask "audio-hijack"
cask "chatgpt"
cask "claude-code"
cask "codex-app"
cask "cursor"
cask "daisydisk"
cask "docker-desktop"
cask "fission"
cask "ghostty"
cask "git-credential-manager"
cask "github"
cask "google-chrome"
cask "imageoptim"
cask "loopback"
cask "microsoft-excel"
cask "microsoft-powerpoint"
cask "microsoft-teams"
cask "microsoft-word"
cask "obsidian"
cask "postman"
cask "slack"
cask "tvanreenen/tap/frame"
cask "tvanreenen/tap/key"
cask "whatsapp"
cask "codex"
